app/controllers/ipv4_quizzes_controller.rb

SELECT COUNT(*) FROM "ipv4_quizzes" WHERE "ipv4_quizzes"."user_id" = $1  [["user_id", 1]]
INSERT INTO "ipv4_quizzes" ("quiz_type", "quiz_number", "question_count", "attempts", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["quiz_type", "ipv4_quiz"], ["quiz_number", 1], ["question_count", 10], ["attempts", 0], ["user_id", 1], ["created_at", "2024-02-02 16:48:40.465226"], ["updated_at", "2024-02-02 16:48:40.465226"]]
---
  def create
    @quiz = Ipv4Quiz.new(permitted_params)
    authorize @quiz
    @quiz.user = current_user
    @quiz.quiz_number = @quiz.user.ipv4_quizzes.count + 1
    if @quiz.save